# NewConstruction Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSpaceConstruction..::..NewConstruction Method
MEPSpaceConstruction Class See Also
---
Create a new construction for Space constructions.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPBuildingConstruction NewConstruction(
	string pName
)
```

Visual Basic
---
```text
Public Function NewConstruction ( _
	pName As String _
) As MEPBuildingConstruction
```

Visual C++
---
```text
public:
MEPBuildingConstruction^ NewConstruction(
	String^ pName
)
```

# ### Parameters
pName
    Type: System..::..StringThe name of the new Construction.
# Remarks
If the name is same as an existing one, an exception will be thrown.
# See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace